Revit 2024 API
PresetInitialColor Class
 This class encapsulates a preset initial lighting color.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class PresetInitialColor : InitialColor
Visual Basic
Public Class PresetInitialColor _
	Inherits InitialColor
Visual C++
public ref class PresetInitialColor : public InitialColor
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.InitialColor
 Autodesk.Revit.DB.Lighting.PresetInitialColor
See Also
PresetInitialColor Members
Autodesk.Revit.DB.Lighting Namespace